app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "country", "picture", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @city = City.create(city_params)

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1 ORDER BY "posts"."created_at" DESC  [["city_id", 2]]
---
  def show
    @city = City.friendly.find(params[:id])
    @post = Post.new
    @posts = City.friendly.find(params[:id]).posts.order(created_at: :desc)